sparkfun/Arduino_Apollo3/boards.txt
# Copyright (c) 2019 SparkFun Electronics

# Permission is hereby granted, free of charge, to any person obtaining a copy
# of this software and associated documentation files (the "Software"), to deal
# in the Software without restriction, including without limitation the rights
# to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
# copies of the Software, and to permit persons to whom the Software is
# furnished to do so, subject to the following conditions:

# The above copyright notice and this permission notice shall be included in all
# copies or substantial portions of the Software.

# THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
# IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
# FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
# AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
# LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
# OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
# SOFTWARE.

###############################################################

artemis.name=SparkFun Artemis Module
artemis.build.variant=SparkFun_Artemis
artemis.build.board=SFE_ARTEMIS
artemis.upload.tool=ap3Loader
artemis.upload.maximum_size=960000
artemis.build.arch=APOLLO3
artemis.build.mcu=cortex-m4
artemis.build.f_cpu=48000000L
artemis.build.core=arduino
artemis.build.defs=
artemis.build.includes=-I{build.variant.path}/bsp -I{build.variant.path}/config
artemis.build.libs=
artemis.build.extra_flags=-DPART_apollo3 -DAM_PACKAGE_BGA -DAM_PART_APOLLO3 
artemis.build.ldscript={build.variant.path}/linker_scripts/gcc/flash_with_bootloader.ld
artemis.upload.maximum_size=960000

###############################################################

amap3nano.name=SparkFun Artemis Nano
amap3nano.build.variant=SparkFun_Artemis_Nano
amap3nano.build.board=AM_AP3_SFE_ARTEMIS_NANO
amap3nano.upload.tool=ap3Loader
amap3nano.upload.maximum_size=960000
amap3nano.build.arch=APOLLO3
amap3nano.build.mcu=cortex-m4
amap3nano.build.f_cpu=48000000L
amap3nano.build.core=arduino
amap3nano.build.defs=
amap3nano.build.includes=-I{build.variant.path}/bsp -I{build.variant.path}/config
amap3nano.build.libs=
amap3nano.build.extra_flags=-DPART_apollo3 -DAM_PACKAGE_BGA -DAM_PART_APOLLO3 
amap3nano.build.ldscript={build.variant.path}/linker_scripts/gcc/flash_with_bootloader.ld
amap3nano.upload.maximum_size=960000

###############################################################

amap3bare.name=SparkFun BlackBoard Artemis
amap3bare.build.variant=SparkFun_BlackBoard_Artemis
amap3bare.build.board=AM_AP3_SFE_BB_ARTEMIS
amap3bare.upload.tool=ap3Loader
amap3bare.upload.maximum_size=960000
amap3bare.build.arch=APOLLO3
amap3bare.build.mcu=cortex-m4
amap3bare.build.f_cpu=48000000L
amap3bare.build.core=arduino
amap3bare.build.defs=
amap3bare.build.includes=-I{build.variant.path}/bsp -I{build.variant.path}/config
amap3bare.build.libs=
amap3bare.build.extra_flags=-DPART_apollo3 -DAM_PACKAGE_BGA -DAM_PART_APOLLO3 
amap3bare.build.ldscript={build.variant.path}/linker_scripts/gcc/flash_with_bootloader.ld
amap3bare.upload.maximum_size=960000

###############################################################

edge.name=SparkFun Edge
edge.build.variant=SparkFun_Edge
edge.build.board=SFE_EDGE
edge.upload.tool=ap3Loader
edge.upload.maximum_size=960000
edge.build.arch=APOLLO3
edge.build.mcu=cortex-m4
edge.build.f_cpu=48000000L
edge.build.core=arduino
edge.build.defs=
edge.build.includes=-I{build.variant.path}/bsp -I{build.variant.path}/config
edge.build.libs=
edge.build.extra_flags=-DPART_apollo3 -DAM_PACKAGE_BGA -DAM_PART_APOLLO3 
edge.build.ldscript={build.variant.path}/linker_scripts/gcc/flash_with_bootloader.ld

###############################################################